[
  {
    "id": "why-being-average-is-sometimes-better-2026",
    "title": "Why being average is sometimes better.",
    "excerpt": "Being average can offer the best of both worlds—learning from high achievers while supporting those who struggle, all while growing through failure.",
    "department": "sarvagya",
    "date": "January 18, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Srija Bhaduri",
      "role": "CSE (AIML) | 1st Year"
    },
    "paragraphs": [
      "<b>Why being average is sometimes better.</b>",
      "Greetings dear friends! Today I'll be speaking on the topic 'Why being average is sometimes better.'",
      "A person who is average, gets to live the best of both worlds. For instance, I am an average student.",
      "Let’s say in my class, there are two groups of people. There’s a first group of students who are struggling in their academics; and then there is a second group of students who perform well in their academics.",
      "I can receive help from the students who perform better since I have an urge to learn.",
      "And I can also help the students who are struggling because I know what it feels like to be struggling myself.",
      "I can group myself into both these groups of people.",
      "Being average is like a bucket half full. I already acquire enough water to quench my thirst; but I also have enough space, to fill myself with more water and with more knowledge.",
      "I am not to be mistaken with a student who is very high achieving just because I have the urge to learn.",
      "Why? Because I can fail. And honestly speaking, I have the habit of failing.",
      "This gives me the scope to rise up faster from my falls.",
      "This gives me the scope to try, fail, try again, and maybe, in the end, succeed.",
      "Dear friends, my name is Srija Bhaduri, and this was the speech of a very average student.",
      "Thank you so much."
    ],
    "images": [
      {
        "id": "d/1p_9A7n0k0JWIFXUILUkf1RVexEal1uiY",
        "caption": "Why being average is sometimes better: finding growth, balance, and resilience in everyday learning.",
        "position": 1
      }
    ]
  },
  {
    "id": "we-dont-talk-anymore-ayush-kumar-shah",
    "title": "WE DON’T TALK ANYMORE",
    "excerpt": "A personal reflection on the impermanence of friendships and the complexities of human connection and misunderstanding.",
    "department": "sarvagya",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Ayush Kumar Shah",
      "role": "3rd Year, Department of CSE, Academy of Technology [Roll: 16900124085]"
    },
    "paragraphs": [
      "WE DON’T TALK ANYMORE",
      "It’s amazing, isn’t it? When I was younger, I used to wonder at the beautiful people around us. I felt one familiar tone, one smirk that resonated, and soon I was surrounded by a bunch of folks called friends.",
      "I felt safe around them. I felt comfortable. I felt me. There were times we hung on the edge, but we hung together. It wasn’t complicated then. We grew side by side and wished: “May it never change, and may it never change us.” But feelings reveal their impermanence. In one blink—we were miles apart, chasing the imaginary yields of this hallowed life.",
      "I felt alone then. New walls weren’t any friendlier than the ones I’d built myself. There were new vessels in the same tides, but I couldn’t help catching the wind when I should’ve flown along. Days passed, and so did I—all by myself. No tone, no smirk resonated. Even the air that once raced through my lungs felt suffocating. That was when things took an unusual turn.",
      "I was assigned to a group project. Among the four of us, one stood out—the person who changed the way I would ever feel anything, for anyone. She was the first to be good to me. We worked together, talked—even if only professionally. We exchanged pieces of ourselves, shared enough that one familiar tone, one smirk returned, and suddenly I felt like I had friends again.",
      "Even after the job was done, the pieces stuck. We laughed at ridiculous gestures through scattered texts. She had her life, I had mine. Sometimes days, weeks went silent; then came outbursts of taunts and tears reflecting nothing but the depth I kept for her. Once, I asked her advice on spectacles. After her playful digs, she suggested frames for those eyes, that always saw beyond the lens, but beneath the lies. Days went by and silence grew like nights—when crickets chirped so sharply your thoughts scattered if you let them. Texts became souvenirs—sometimes I received them, sometimes I didn't. I thought I understood her, but I didn’t.",
      "My paranoia won. I stopped sharing pieces, thinking we’d quietly part. There was no bitterness, only a quiet understanding. I placed the scarf of fate into my closet of closures—until one sudden day she asked why I’d been avoiding her. I let the question pass. Why would she ever consider all these? The fascination had always been mine alone.",
      "A few days later, I tried to mend the knots. Instead, I received expositions: how I had forced conversations, done things I didn’t want. Her message was clear: whatever had been, was no more. It took me four days to recover. Broken stars and unfulfilled wishes do not belong together—and neither did we. I knew I had messed up, so I pushed her away, made myself repulsive, hiding behind ambiguous texts. When she confessed—asking if I had expected our friendship to evolve—I gave no clarity. She assumed nothing would be normal again.",
      "There was a line between bond and pride, but what swallowed me was neither: a conflicted affection. I put someone on a pedestal I wouldn’t dare for myself, lacking courage to speak even once. A third self was born—one who could’ve chosen the heart but went for an eye. We, as humans, are flawed. Some accept, some do not. I expected, I wronged, I accepted, and now I’m again hanging on the edge. The pieces remain—ashes of bridges I could’ve built to-get-her, crossed to-get-her; burnt in the pursuit to-get-her."
    ],
    "images": [
      {
        "id": "1m0f_AYUSH_KUMAR_SHAH_DRIVE_ID",
        "caption": "Fragments of memory and broken connections.",
        "position": 1
      }
    ]
  },
  {
    "id": "student-power-revolution-surjyava-das",
    "title": "The Silent Revolution of Student Power",
    "excerpt": "Defining the modern student as a catalyst for change in an era of limitless knowledge and digital opportunity.",
    "department": "sarvagya",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Surjyava Das",
      "role": "1st Year, Department of CSE [Roll: 192], Academy of Technology"
    },
    "paragraphs": [
      "The Silent Revolution of Student Power",
      "We are always told that we are \"the future,\" but less often that we are also the present. Currently, in laboratories, classrooms, and all-night study sessions, a quiet revolution is unfolding. It does not require marches or megaphones. Its armor is curiosity, teamwork, and an unbreakable conviction that we can make the world before the world makes us.",
      "The student of today is no longer bound by the chalkboard or the book. We exist in an universe of instant knowledge and limitless potential. An adolescent with a laptop can start a company, create a game, or crack a mathematical equation that took a whole research team before. Knowledge is no longer behind the door; it is open sky. It is not a question of whether we can touch it, but whether we have the courage to fly.",
      "But freedom is a double-edged sword. With infinite options comes infinite distraction. The light of a notification can overpower the spark of an idea. The task of our generation is not only to learn, but to learn with intention. To opt for creation instead of consumption. To scroll less and think more.",
      "This revolution of silence starts with small actions. When a student sits in the library late at night to grasp a concept and not just memorize it for a mark, that is resistance. When a group of friends work on a project not because they have to but because they feel the concept, that is rebellion. When someone among us has the courage to dream beyond the confines of marks and placements, that is a spark.",
      "Real success isn't about getting a secure job or a glinting degree anymore. It is making impact—through some revolutionary invention, or a compelling narrative, or just one random act of kindness that resonates outward. Students aren't holding their breaths for permission to make a difference; we're already rewriting the rules in code, in art, in activism, and in the choices we make every day.The world tends to underestimate students, viewing only inexperience when possibility exists. But history has a different tale to tell. Whether scientific discoveries or social revolutions, more often than not, it is the young who ignite the first flame. We are living testaments to the fact that age is not a limit; it is a launching pad.",
      "So, to all of the students who read this: the revolution isn't out there—it's in you. It starts each time you ask questions, make things, and refuse to accept anything less. The future doesn't have to wait. It begins in the next idea you have the courage to pursue, the next issue you have the courage to solve, the next dream you refuse to put off."
    ],
    "images": [
      {
        "id": "1stCSE_192_SURJYAVA_DAS_DRIVE_ID",
        "caption": "The spark of student innovation and curiosity.",
        "position": 1
      }
    ]
  },
  {
    "id": "it-work-culture-debangshu-mondal",
    "title": "Beyond the Code: Navigating Today's IT Work Culture",
    "excerpt": "Analyzing the shift toward remote work, the impact of hustle culture, and the rise of 'quiet quitting' in the IT industry.",
    "department": "sarvagya",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Debangshu Mondal",
      "role": "2025 Graduate, Department of CSE, Academy of Technology [Roll: 16900124138]"
    },
    "paragraphs": [
      "Beyond the Code: Navigating Today's IT Work Culture",
      "The modern IT landscape seems radically transformed from those cubicle farms of the past decade. The old daily commute and in-person meetings that were the way of the world are now irretrievably broken. Our work culture is always changing because we focus on remote work, we're always trying new things, and our team is redefining what a 'job' is.",
      "What was once a stopgap has evolved into a stable fixture for millions, providing an unparalleled degree of mobility. But this freedom comes with its price. The spatial limits of the office have broken down, but so have the temporal ones. The \"9-to-5\" has given way to an \"always-on\" expectation for some, where Slack notifications dissolve the boundary between work and life. We've substituted the commute for the battle to log off. It's harder, too, to encourage substance of connection; spontaneous whiteboard meetings are now scheduled video sessions, and effortless collaboration and mentorship are more difficult to replicate.",
      "And meanwhile, there's a cultural struggle going on. On the one hand, there's this pervasive \"hustle culture\" of working too much and having to constantly upskill in order to stay up to date in an industry where today's hip architecture is tomorrow's legacy technology. All this constant stress takes a toll on mental health on the one hand. On the other is an emerging counter-culture. Phrases as \"quiet quitting\" aren't lazy, they are employees drawing a strong line and pushing back against the notion that their work must be their entire identity. It is a quiet, necessary resistance against burnout.",
      "IT workers are looking for something more than a competitive salary nowadays. A positive work culture , the ability to actually make an impact , and work-life balance are no longer standard benefits but minimum expectations. The dynamic is changing, with great people less accepting of toxic cultures or the absence of meaningful work. They are interviewing organizations as much as organizations are interviewing them, examining the values of an organization and its impact in the real world before signing on.",
      "It requires more than technical skill to work in this new world. It requires flexibility, effective communication, and self-discipline to define your own boundaries. The IT labour of the future is not just about code that we produce but also about the culture that we create together—culture that has a balance between ferocious innovation and the well-being of the folks that create it."
    ],
    "images": [
      {
        "id": "2025CSE_16900124138_DEBANGSHU_MONDAL_DRIVE_ID",
        "caption": "The shifting boundaries of the modern remote IT workspace.",
        "position": 1
      }
    ]
  }
]
