[
  {
    "id": "shesh-pata-asmi-saha",
    "title": "শেষ পাতা (The Last Page)",
    "excerpt": "A touching Bengali story about moving past heartbreak and finding the courage to love again.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "5 min read",
    "author": {
      "name": "Asmi Saha",
      "role": "3rd Year, Department of CSBS, Academy of Technology [Roll: 16931123019]"
    },
    "paragraphs": [
      "শেষ পাতা",
      "আজ সকাল থেকেই বৃষ্টি হচ্ছে বলে অফিস যায়নি অভিরাজ৷ চুপচাপ বারান্দায় দাঁড়িয়ে সেদিনের কথা ভাবছে৷ সেদিনের কথা, তিতলির কথা৷",
      "সকাল থেকে বৃষ্টি পড়ছে। তার মধ্যে তিতলি আর অভিরাজ রাজবাড়ির সিঁড়িতে বসে আছে।",
      "---\"দেখো অভি, কী সুন্দর লাগছে রাজবাড়িটা।“",
      "অভি তিতলির দুহাত বসে ধরে বলে,\" হুম। আচ্ছা,আমাকে আজ একটা কথা দেবে, তিতলি? তুমি আমাকে কোনোদিন ছেড়ে যাবে না তো?\"",
      "---\"হঠাৎ এসব কী কথা? তুমি আমাকে জোর তাড়িয়ে দিলেও যাবো না৷ আমাকে বিশ্বাস করো না?\"",
      "---\"না আসলে তুমি তো জানো আমার আগের দুজন কীভাবে ছেড়ে গেছে৷ একবারও ভাবেনি আমার কী হবে। তাই ভয় করে আর কি।\"",
      "তিতলি অভিরাজের আরো কাছে এসে বসে বলে,\" আমি তো আর ওদের মতো নই৷ আমি কখনোই তোমাকে ছেড়ে যাবে না দেখো। \"",
      "অভি আস্তে আস্তে তিতলিকে জড়িয়ে ধরে শক্ত করে৷ যেন ছেড়ে দিলেই হারিয়ে যাবে৷ যদিও সত্যিই সে কোনোদিন হারাতে দিতেও চায় না৷ মেয়েটা যে সত্যিই ভালোবাসে ওকে৷",
      "পরদিন অভিরাজ অফিসের পর রোজকার মতো তিতলির সাথে দেখা করে।",
      "কিন্তু আজকে তিতলির সাথে অন্য একটা ছেলেকে দেখে ও অবাক হয়ে জিজ্ঞেস করে, \"ও কে তিতলি?\"",
      "\"ওহো তোমাকে বলা হয়নি, ও আমার বয়ফ্রেন্ড। We are soulmates and I want breakup from you…\"",
      "অভি কথাগুলো বিশ্বাস করতে পারছে না৷ এটা কী করে সম্ভব? যে মেয়ে কালকেও এত কিছু বলল, সে আজ এভাবে.....",
      "কোনো রকমে নিজেকে সামলে নিয়ে বলে, \"এগুলো তুমি কী বলছো তিতলি? তুমি তো বলেছো সারা জীবন আমার পাশে থাকবে, তাহলে? চুপ করে থেকো না প্লিজ। আমি তো বাঁচবোই না তোমাকে ছাড়া।\", অভি এবার তিতলির পা ধরে কেঁদে ফেলে।",
      "তিতলি অভিরাজের দিক থেকে মুখ ফিরিয়ে নিয়ে বলে, \"তুই মরলে মর, আমার কিছু যায় আসে না।\", বলে ওকে ফেলে চলে যায়।",
      "অভি আস্তে আস্তে বজ্রাহতের মতো উঠে পড়ে। যাকে নিজের থেকে বেশি ভালোবাসলো, অন্ধের মতো বিশ্বাস করল, সে-ই তাকে ঠকালো। আর কীই বা করতে পারে সে? শুধু নিজেকে একজন ব্যর্থ মানুষ মনে করা ছাড়া?",
      "এতক্ষণ রানী অভিরাজের কথা মন দিয়ে শুনছিল৷ ছেলেটা যে বড্ড কষ্ট পাচ্ছে। রানী জানে রাজ মুখে কিছুই বলবে না। তাই সে কিছুক্ষণ চুপ করে শুধু জড়িয়ে ধরে বসে থাকে।",
      "---\"তুমি সব জানার পরেও কেন আমাকে ভালোবাসলে, রানী?",
      "---\"রাজ, ভালোবাসা কোনো নিয়ম মানে না৷ তুমি নিজেও জানো না তুমি কতটা সুন্দর মনের মানুষ। ছেড়ে তো সবাই যাতে পারে কিন্তু ধরে রাখার সাহস কজনের থাকে? যাওয়ার হলে তোমার অতীত শুনেই যেতাম। যাইনি কারণ আমি তোমাকে, তোমার চরিত্রকে ভালোবেসেছে রাজ, তোমার টাকা, স্ট্যাটাস, রূপ এসবকে না। আর না-ই আমি তোমার অতীতকে ঘৃণা করি।\"",
      "---\" কিন্তু তুমি তো আমার প্রথম ভালোবাসা নও?\"",
      "---\"প্রথম ভালোবাসা নই তো কী হয়েছে? আমি তোমার শেষ ভালোবাসা। সেটা তো আরও বড়ো পাওনা আমার কাছে। রাজ, আমি তোমার জীবনের গল্পের প্রথম পাতা হতে চাই না, কোনো দিন চাইওনি৷ কিন্তু আমি তোমার মনখারাপে লেখা ডায়েরির শেষ পাতাটা হতে চাই। আর সারা জীবন তা-ই থাকতে চাই৷ দেবে তো হতে?\"",
      "অভিরাজ এবার হেসে ফেলে৷ বলে, \"এতদিন পর এখন ম্যাডাম আমাকে প্রোপোস করছেন নাকি?\"",
      "---\"খুব শখ না? যাও কিছু বলবোই না।\"",
      "রানী উঠতে গেলে অভিরাজ তাকে আটকায়। কাছে এসে বলে, \"রাজ কী করে তার রানীকে ছাড়া জীবনের রাজ্যপাট চালাবে শুনি? যা কেউ বোঝে না তা তুমি বোঝো। সারাজীবন এভাবেই আমার পাশে থেকে আমাকে বুঝবে তো রানী?\"",
      "---\"না, সারাজীবন থাকবো না।\"",
      "অভিরাজ চমকে ওঠে। বলে, \"মানে? কী বলছো তুমি?\"",
      "রানী অভিরাজের গলা জড়িয়ে কানের কাছে এসে বলে, \"এই যে ঘাড়ে চেপেছি, আর সাত হাজার জন্ম অবধি নামছি না। বুঝলেন মহারাজ?\"",
      "---\"বুঝলাম। আর একটা কথা বলবো?\"",
      "---\"বলো।\"",
      "---\" I love u\"",
      "রানী শুধু অভিরাজের দিকে তাকায়। কেন জানি না প্রথম বারের জন্য তার মনে হয় সে যেভাবে এতদিন তার রাজকে ভালোবেসেছে, রাজের চোখেও তার প্রতি সেই একই ভালোবাসা দেখতে পাচ্ছে। তাহলে কি রাজও তাকে ভালোবাসে?",
      "ওদিকে ঘরে গান চলছে,\" Main kahin bhi jaata hoon, tum se hi mil jaata hoon\"....."
    ],
    "images": [
      {
        "id": "3rdyrCSBS_16931123019_ASMI_SAHA_DRIVE_ID",
        "caption": "A rainy day reflection on love and the last page of a diary.",
        "position": 1
      }
    ]
  },
  {
    "id": "climate-change-catastrophe-anindya-ghosh",
    "title": "The Silent Catastrophe: Climate Change",
    "excerpt": "A stark warning about the atmospheric and physical changes affecting West Bengal and the global population.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "5 min read",
    "author": {
      "name": "Anindya Ghosh",
      "role": "Academy of Technology"
    },
    "paragraphs": [
      "The Silent Catastrophe: The Climate Change",
      "When we look outside the window, we just see everyone running like mad horses, dying every moment just in order to prove and persist their existence. Turn on the media, and the air is filled with debates some celebrating how science will produce unimaginable technologies in the next ten or fifteen years, while others lament how AI will challenge jobs, intelligence, and the very idea of being human. Yet, very few are speaking about the most important and alarming issue that is silently threatening our survival—the climate change.",
      "Let’s not talk about the world for a moment, and just see the weather here around in West Bengal, our home. In 2025, we barely experienced what one might call a ‘summer’, but whatever few weeks we had, it felt as if the Earth had turned into a furnace. The sun was unrelenting, humidity unbearable, and each breath outdoors felt like inhaling from a hot pressure cooker.",
      "These aren’t just weather anomalies. They are symptoms of a deeper planetary imbalance. While we often understand climate change as rising temperatures or melting glaciers, the truth is it’s now powerful enough to affect even the most fundamental physical constants of our planet. One such example is gravity. NASA’s GRACE missions have shown how massive glacier melt is redistributing Earth’s mass, leading to detectable changes in the local gravitational field.",
      "Alongside gravity, the very air we breathe is being reshaped. As the atmosphere heats up, it expands. This affects the way pressure systems form and move, leading to unstable weather conditions like heat domes, unseasonal rains, or prolonged dry spells. The World Health Organization (WHO) has reported sharp increases in climate-linked health conditions. High humidity and extreme heat can damage human baroreceptors, the sensors that regulate blood pressure.",
      "What’s the point of future technologies if the future itself burns us alive or drowns our cities? According to safety standards marked by the Paris Agreement, each person on earth must restrict their annual carbon emission limit per year to 8 tonnes only. In a time when climate is no longer a global issue but a deeply personal one, what role do you think you as an individual must play?"
    ],
    "images": [
      {
        "id": "Article_ANINDYA_GHOSH_DRIVE_ID",
        "caption": "Visualizing the heat dome and atmospheric pressure anomalies.",
        "position": 1
      }
    ]
  },
  {
    "id": "cant-we-keep-the-monster-alive-srija-bhaduri",
    "title": "Can’t We Keep The Monster Alive?",
    "excerpt": "A fantasy tale of exile, transformation, and finding belonging in imperfection.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Srija Bhaduri",
      "role": "1st Year, Department of CSE-AIML, Academy of Technology [Roll: 54]"
    },
    "paragraphs": [
      "Can’t We Keep The Monster Alive?",
      "The prince had always been gentle and curious, beloved for his kindness and bright spirit. He wandered the castle halls with wide-eyed wonder, dreaming of forests and distant skies. But even the most radiant hearts can draw shadows, and one morning, everything began to change. The prince awoke to antlers curling from his brow, glinting like shards of moonlight. The court, once enamored, recoiled in fear and whispers, and the kingdom’s gates closed behind him. Exiled at dawn, he stepped into the world beyond, where perfection no longer ruled, and magic waited in the shadows.",
      "Shadows of towering trees whispered secrets he could almost understand. Amid the mist, he saw a raven, one wing torn, struggling beneath a bramble. Thinking it a simple bird, he rushed to help, but his hands faltered, helpless. In a desperate tribute of the dying bird, he reached up his own hands, and broke one of his own antlers. He hoped the bird will feel his companionship during death.",
      "At once, the raven’s body shimmered and grew immense, its torn wing glowing, eyes glinting with intelligence beyond mortal measure. The prince staggered back, realizing he had aided a magical creature. Then the others emerged: the bear, his heart hollow, but whispering; the squirrel, crowned in golden bones of his own destruction; the serpent, its eye blind and glowing.",
      "The prince held his broken antler, trembling. The creatures gathered, eyes reflecting some silent accord. A glow enveloped him, gentle yet relentless. His form stretched, muscles and fur knitting anew, antlers branching skyward, one still broken. He had become a magnificent deer—powerful, graceful, yet touched by imperfection.",
      "In the forest’s hush, he understood: belonging was not the kingdom he had lost, nor perfection he had never known. It was this—fractured yet whole, chosen yet free, among beings who bore their scars as crowns. And as dawn broke, the wind whispered through the glowing antlers: some transformations demand sacrifice, and some truths are visible only to those who dare to break."
    ],
    "images": [
      {
        "id": "1stYearCSE_AIML_SRIJA_BHADURI_DRIVE_ID",
        "caption": "The prince's transformation into the antlered creature of the forest.",
        "position": 1
      }
    ]
  },
  {
    "id": "for-the-one-who-waits-soumyajit-sarkar",
    "title": "For the One who Waits",
    "excerpt": "A poem detailing the enduring patience of a girl waiting for her sailor love to return from the sea.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Soumyajit Sarkar",
      "role": "2025-26 Session, Department of CSE, Academy of Technology [Roll: 171]"
    },
    "paragraphs": [
      "On top a cliff , in a small port town,",
      "stood a girl in grey;",
      "pale skin ,brown hair, blue eyes,",
      "with the wind she swayed.",
      "With patience she had waited",
      "for her love had set out to sea,",
      "but her love for him had not abated.",
      "Ten years ago, on this day",
      "he had answered the call to adventure.",
      "leaving behind all he knew;",
      "he left without a parting gesture.",
      "He promised to return to her ;",
      "when he made a fortune, but",
      "the wrath of the sea he did incur,",
      "but his struggles were not without.",
      "And the girl, she waited day and night",
      "and the people let her be;",
      "For her heart’s with a sailor,",
      "Who ploughs the raging sea."
    ],
    "images": [
      {
        "id": "2025_26_CSE_171_SOUMYAJIT_SARKAR_DRIVE_ID",
        "caption": "The girl in grey standing atop the cliff overlooking the sea.",
        "position": 1
      }
    ]
  },
  {
    "id": "rcb-magazine-aryan-prasad",
    "title": "RCB: A Story Beyond Silverware",
    "excerpt": "A narrative of loyalty and persistence, focusing on Virat Kohli and RCB's journey to their 2025 triumph.",
    "department": "sports",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Aryan Prasad",
      "role": "2025 Graduate, Electrical Engineering, Academy of Technology [Roll: 005]"
    },
    "paragraphs": [
      "In the world of cricket, glory is often measured in trophies. Teams rise and fall, players come and go and the history book remember winners. Yet there exists a story that is beyond a silverware, a tale woven with loyalty and undying belief—THE STORY OF ROYAL CHALLENGERS BENGALURU(RCB) AND VIRAT KOHLI.",
      "When IPL started in 2008 since then this team was everyone’s favourite to win the trophy every year but RCB was unable to do so until 2024. Despite having world class players the team failed to lift the trophy year after year. But through every storm one man stood tall—VIRAT KOHLI.",
      "In 2016 Kohli played a season that became legendary—973 runs in one IPL season. He scored 4 centuries and carried RCB to the finals. But in the final the team fell short of 9 runs while chasing and lost. After multiple heartbreaks, came 2025. Things were really different. RCB finally lifted the IPL trophy by defeating Punjab Kings in the final by 6 runs.",
      "Fans and even Virat Kohli himself became emotional after the win. This win symbolized the power of dreaming big despite setbacks. Virat Kohli proved that true champions are defined not only by trophies but their consistency, passion and refusal to give up. Success is not only about the destination, it is about the courage to keep walking."
    ],
    "images": [
      {
        "id": "rcb_magazine_ARYAN_PRASAD_DRIVE_ID",
        "caption": "Virat Kohli and the RCB team celebrating their 2025 victory.",
        "position": 1
      }
    ]
  },
  {
    "id": "chasing-the-light-susrita-dutta",
    "title": "Chasing The Light",
    "excerpt": "A personal essay on finding hope and resilience in the face of life's challenges.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Susrita Dutta",
      "role": "2025 Graduate, Department of EEE, Academy of Technology [Roll: 16902824041]"
    },
    "paragraphs": [
      "Title: Chasing The Light",
      "Sometimes mornings too feel like the world is dark, airless, endless. Only emptiness and disappointments turn into our daily life partner and then.. A crack of light tears open our chest to show us the real meaning of life. Because maybe, just maybe, the life is all about nothing but the art of chasing the light.",
      "Life is like a burning candle. Wind will try to blow it again and again but the light always returns. And some where I feel, hope is the thing that makes the light of life return again and again. Once you lose the hope, you lose the game.",
      "I used to feel that I am the light of the world itself. I am the heroine, “God’s favorite child”, nothing can happen wrong with me and then life hit me like thunder. I stopped leaving my house. But I became like a ‘Dukhi Atma’. Now you can ask what I did to get out of it. Did I stand up suddenly and throw open my windows so Light could pass? No. I accepted the darkness.",
      "Then I realized that I am the heroine. If I lose hope, It is over. And somehow something inside me exploded. I don’t think there are so many people who hasn’t watched Yeh Jawani Hai Deewani movie. The real light of the story was Naina. She was heart broken, but she never let it stop her. She worked hard and at the end she got what she has always wanted.",
      "And that’s how we know that all we have to do is stick to our dreams and chase the light. Cause at the end everything jut sort out like a movie. And if it’s not, then wait my people, “Picture abhi baaki hain!!”"
    ],
    "images": [
      {
        "id": "2025EEE_16902824041_SUSRITA_DUTTA_DRIVE_ID",
        "caption": "The metaphor of light emerging from the darkness of a candle.",
        "position": 1
      }
    ]
  },
  {
    "id": "the-last-notification-durba-kushari",
    "title": "The Last Notification",
    "excerpt": "A haunting short story about the digital loop of social media and the cost of lost hours.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Durba Kushari",
      "role": "Academy of Technology"
    },
    "paragraphs": [
      "Maya’s phone buzzed. Again.",
      "She didn’t need to look. Her thumb twitched before her brain caught up. Another alert. Another interruption. Another reminder that she had been drifting through lives that weren’t hers, chasing validation she didn’t feel, losing hours she couldn’t get back.",
      "Then the screen lit up with words that made her chest tighten: “You have one left.” One what? One message? One hour? One life? She recalled the hours she had spent refreshing timelines, the weekends she had let slip by, the dinners she had skipped. All of it—gone, absorbed by the glow of a screen.",
      "The next day, it came again: “One less now.” Her scroll became frantic. Every hour she wasted added weight to her chest. Meals went cold. Texts went unanswered. Sleep became a rumor. She thought of friends she hadn’t called, hobbies abandoned, books untouched.",
      "Maya stared at the black screen and saw herself—not the filtered, smiling version she shared online, but the pale, hollow-eyed girl who had forgotten how to live. She shivered. Then she realized: the phone wasn’t counting down notifications. It was counting down her life. Her own life.",
      "The last notification wasn’t meant for her phone. It was meant for everyone. And not everyone would see it."
    ],
    "images": [
      {
        "id": "The_Last_Notification_DURBA_KUSHARI_DRIVE_ID",
        "caption": "A lone figure illuminated by the cold blue light of a smartphone screen.",
        "position": 1
      }
    ]
  },
  {
    "id": "one-peace-sohan-kumar-modak",
    "title": "☮︎ne Peace: A Creative Reflection",
    "excerpt": "How the manga 'One Piece' inspires real-world activism and leadership among Gen Z.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Sohan Kumar Modak",
      "role": "Academy of Technology"
    },
    "paragraphs": [
      "☮︎ne Peace",
      "Our world is not stationary; it continuously changes through inventions, revelations, and revolutions. Today, the most influential story shaping Gen Z is One Piece, the Japanese manga by Eiichiro Oda, one of the world’s top-selling authors with over 530 million copies sold.",
      "One Piece is a tale of resistance. The Straw Hat Pirates, led by Monkey D. Luffy, represent the audacity to stand against corrupt systems like the World Government. Furthermore, One Piece speaks to global unity. Pirates from every sea, different races, and even former enemies unite when faced with the tyranny of the Celestial Dragons.",
      "Luffy himself represents reckless bravery and defiance. His spirit resonates with youth facing oppression. Arcs like Enies Lobby reflect resistance to unjust governments, while Fishman Island symbolizes the struggle against racism. Young readers see their own battles mirrored in these stories.",
      "Beyond resistance, One Piece reshapes the idea of leadership. Luffy leads not with authority but through trust, equality, and friendship. Modern protests mirror this spirit: decentralized, collective, and united under one dream of freedom. The “Will of D.” is not merely a fictional mystery; it has become a metaphor for inherited courage.",
      "Most importantly, One Piece reframes the idea of treasure. It is not material wealth but the dream of liberation, dignity, and shared laughter. What is real treasure? For many, it is justice, dignity, and community. The story offers courage to rise, resist, and dream of a world without chains."
    ],
    "images": [
      {
        "id": "One_Peace_creative_writting_SOHAN_KUMAR_MODAK_DRIVE_ID",
        "caption": "The 'Will of D.' symbolizing inherited courage and resistance.",
        "position": 1
      }
    ]
  },
  {
    "id": "transgender-rights-basundhara-chatterjee",
    "title": "THE TRANSGENDERs: A Society in Denial",
    "excerpt": "A call for empathy and social acceptance for the third gender community in India.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "5 min read",
    "author": {
      "name": "Basundhara Chatterjee",
      "role": "Academy of Technology"
    },
    "paragraphs": [
      "THE TRANSGENDERs",
      "Let us imagine living in a world where your existence is constantly questioned, where your freedom to live is taken, your choices ignored, and your existence stigmatized. Imagine waking up every single day with the fear of being judged by society. Yes i am talking about another god's wonderfull creation \"THE TRANSGENDER\" community.",
      "Who you are? Either a male or a female, but what if you feel different from the way you are identified during birth. What if your gender identity differs from your sexual orientation? Isn't it a constant conflict? The term \"THIRD GENDER\" refers to individuals whose identity does not fit strictly into the traditional categories. Unlike biological sex, gender identity is an inner sense—it comes from the soul, not the body.",
      "Learning should start from microlevel. Just not societal hatred or discrimination but before these little kids could understand anything, their parents introduce them to the dark reality of their lives. When it's time to enjoy childhood, they face extreme abandonment. Thus they start blaming god and cover themselves up inside a coconut shell.",
      "India got freedom in the year 1947 but transgenders got identified as the \"third gender\" and thus their freedom as well as voting right on 2014 through the NALSA judgement. Despite legal recognition, society refuses to accept them. In conclusion, transgender individuals face immense challenges, and provision of equal opportunities can make a profound difference."
    ],
    "images": [
      {
        "id": "transgender_BASUNDHARA_CHATTERJEE_DRIVE_ID",
        "caption": "The spectrum of gender identity and the path to social inclusion.",
        "position": 1
      }
    ]
  },
  {
    "id": "quiet-burden-tolerance-agnik-biswas",
    "title": "The Quiet Burden of Tolerance",
    "excerpt": "A philosophical exploration of tolerance as both a moral endurance and a cerebral fatigue in the face of global atrocities.",
    "department": "humanities",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Agnik Biswas",
      "role": "2nd Year, Department of ECE3, Academy of Technology [Roll: 16900324148]"
    },
    "paragraphs": [
      "The quiet burden of tolerance",
      "Tolerance is the mark of humanity. To humble our ambitions in the face of relentless cruelty. We practice such silence not to renounce hope but to decree ourselves unworthy of it. To let hope survive for the masses when we have failed to wield it for the solace of the individual.",
      "Tolerance is the ignorance of the weary for the atrocities of the incessant. A cerebral fatigue that we sanctify as moral endurance. A cruelty masked in virtue. The adaptive humility of a race conditioned to aid and then console its own erasure.",
      "In a world constantly unfolding on screens, we are all bystanders to suffering. War barters the borders of Russia for the blood of Ukraine. The suffering of Gaza no longer draws out cries. We tolerate all that feels too large to change, yield eventually to every tyrant that refuses to bow.",
      "Our kindness is constrained to these pixels of pity. Tragedies are submitted to oblivion faster than the victims can afford to heal. When Tagore invites pain through the melody of “Aro aghat saibe amar”, is it merely resilience? Does he only speak for the quiet martyrs of literature and life?",
      "Art reminds us that tolerance is not merely endurance. Maybe that is the finest expression of free will—to choose restraint without indifference, compassion without naivety. A humanity that endures but also listens."
    ],
    "images": [
      {
        "id": "2ndYearECE3_16900324148_AGNIK_BISWAS_DRIVE_ID",
        "caption": "The digital bystander effect and the burden of global awareness.",
        "position": 1
      }
    ]
  },
  {
    "id": "being-is-blue-priyanjali-mukherjee",
    "title": "Being is Blue",
    "excerpt": "A poetic reflection on decay, chaos, and the various shades of blue within the human experience.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Priyanjali Mukherjee",
      "role": "4th Year, Department of ECE, Academy of Technology [Roll: 16900322006]"
    },
    "paragraphs": [
      "Being is Blue",
      "Pondering over the concept of death, related it to the eternal stillness, stillness with respect to time and space, an indifferent tint of blue; thus, chasing thrills, escaping the paralysis of peace and associating with pure chaos will always be a way of living. Decay has its own shade of blue. The idea of remaining in ruins will always stay contemporary.",
      "Liquor strips away every restraint and baptises corruption in radiance; the illusion of finally being unshackled from consciousness transcends. It provides the escape with perfect ecstasy from the sterile quietude of sanity. While it runs warm through veins, courage radiates cyan and affection becomes a performance in oblivion.",
      "Faithless holiness thrives in the dusk, while the dawn demands caricaturisation of callousness into some white-collar chivalry; caffeine delivers it in cups. Panic. Fear. Aliveness is verified. The shallowest of breaths proves its worth, for it confirms that some faint capacity remains to feel anything beyond numbness.",
      "Tragedy proves survival. A spiteful existence of a despicable soul. So, here the question remains: from the spectrum of blue, which stain would you prefer to be tainted by – the aquamarine blue of placidity or the ultramarine blue of pandemonium?"
    ],
    "images": [
      {
        "id": "4thECE_16900322006_PRIYANJALI_MUKHERJEE_DRIVE_ID",
        "caption": "The spectrum of blue: from placidity to pandemonium.",
        "position": 1
      }
    ]
  },
  {
    "id": "ancient-mysteries-debangshu-mondal",
    "title": "Ancient Civilization: Mysteries and Ideas",
    "excerpt": "A brief overview of the Maya, Aztec, and Indus Valley civilizations, and the myths of Atlantis and El Dorado.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Debangshu Mondal",
      "role": "Session 2025, Department of CSE (AI-ML), Academy of Technology [Roll: 19]"
    },
    "paragraphs": [
      "Imaginative Ideas: Ancient Civilization with many mysteries and ideas",
      "Many civilizations have risen and fallen throughout history, leaving various clues and a hundred mysteries. These stories not only fascinate us but, also make us think about what leads to a societal success or decline.",
      "The Mayan are one of the most famous lost civilizations. They thrived in Central America from about 250 to 900 AD. However, they mysteriously collapsed in the 9th century due to possible drought or warfare. The Aztec Empire was another powerful civilization, defeated by Spanish conquerors in the early 16th century.",
      "Atlantis is perhaps the most legendary of lost civilizations. Plato described it as a prosperous society that sank into the ocean. El Dorado is another famous lost city, often imagined as a place filled with gold and untold riches in South America.",
      "Lastly, the Indus Valley Civilization, existing around 2500 BC, was known for advanced city planning. These lost civilizations encourage us to reflect on the challenges societies face and the resilience they needed to survive."
    ],
    "images": [
      {
        "id": "2025_Cse_AI_ML_Roll_19_DEBANGSHU_MONDAL_DRIVE_ID",
        "caption": "Ancient architectural wonders and mysterious glyphs of lost empires.",
        "position": 1
      }
    ]
  },
  {
    "id": "smell-memory-abhishek-kumar",
    "title": "The Link Between Smell and Memory",
    "excerpt": "The science behind why scents trigger emotional and vivid autobiographical memories through the brain's olfactory pathways.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Abhishek Kumar",
      "role": "1st Year, Department of CSBS, Academy of Technology [Roll: 3]"
    },
    "paragraphs": [
      "LINK BETWEEN SMELL AND MEMORY",
      "Do you ever think why the whiff of perfume or food suddenly remembered a moment from the past? Its because of the link between the smell and the memory.",
      "Smells go straight to the parts of our brain that handle emotions and memories—like the hippocampus and amygdala. Unlike sights and sounds, which take a longer route through the thalamus, smells take a shortcut. This is known as the Proust effect.",
      "When molecules enter our nose, signals are sent on a direct superhighway to the Amygdala (the center of emotions) and the Hippocampus (the major hub for memory storage). Because smell goes straight to these two powerful centers, the memory is instantly infused with the original emotion.",
      "Some of the smells that are unforgettable are: the smell of very first rain, the smell of your mother's sari, and the smell of spices frying in oil. The scent of sunscreen instantly brings back childhood memories of the beach—complete with the sounds and feelings of that moment."
    ],
    "images": [
      {
        "id": "2025CSBS_1styear_roll_3_ABHISHEK_KUMAR_DRIVE_ID",
        "caption": "The neural pathway: from the olfactory bulb to the amygdala and hippocampus.",
        "position": 1
      }
    ]
  },
  {
    "id": "pandal-pulse-suchismita-khan",
    "title": "Pandal Pulse: Where Tradition Meets Innovation",
    "excerpt": "A first-semester student's perspective on the vibrant energy and artistic innovation of Durga Puja on campus.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Suchismita Khan",
      "role": "Department of ECE, Academy of Technology [Roll: 139]"
    },
    "paragraphs": [
      "“PANDAL PULSE : Where Tradition Meets Innovation”",
      "Stepping out my college on Chaturthi, the fourth day of Navratri, I was immediately caught in a swirl of excitement. The usually quiet rural campus had transformed into a festival ground. The “Pandal Pulse” this year beats stronger than ever, as communities showcase extraordinary creativity through their elaborately themed pandals.",
      "The train journey that morning was a part of the celebration itself. Compartments were filled with students carrying bright marigolds and clay idols. Arriving at my rural campus, the transformation was magical. Students worked together to decorate small pandals and organize community activities. What struck me the most was the sense of togetherness.",
      "I wandered from one pandal to another, marveling at the artistry. Some pandals told mythological stories, others displayed contemporary themes inspired by rural life. It was more than just a festival; it was a lesson in collaboration, patience and creativity.",
      "By evening, the rural campus glowed under thousand of lights, the sounds of the dhak resonating with the night breezes. As the train rolled home, the dhak still echoed in my ears. This Chaturthi would remain imprinted in memory, a reminder that even ordinary journeys can turn into extraordinary stories."
    ],
    "images": [
      {
        "id": "2025ECE_139_SUCHISMITA_KHAN_DRIVE_ID",
        "caption": "The artistic brilliance of a Durga Puja pandal at night.",
        "position": 1
      }
    ]
  },
  {
    "id": "social-media-boon-bane-arka-deb-das",
    "title": "Social Media: A Boon or a Bane?",
    "excerpt": "Tracing the history of social media from BBS to modern platforms and its psychological impact on Gen Z.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Arka Deb Das",
      "role": "Department of CSBS, Academy of Technology [Roll: 13]"
    },
    "paragraphs": [
      "SOCIAL MEDIA : A BOON OR A BANE ?",
      "With the dawn of a new medium of communication, which emerged in the late 1970s and 1980s with early online networks, “social media” has now become a “digital cradle” for numerous “netizens” to reside. Precursors like Bulletin Board Systems (BBSs) allowed users to share messages before the World Wide Web was created in 1991.",
      "Social media’s influence began to flourish with tiny yet robust footsteps. It became a “boon” for millennials for helping them keep up with new advancements. However, as it progressed into a “social juggernaut”, it also posed a real threat for young minds to a very complex and materialistic digital world.",
      "To the new generation called “Gen-Z”, it soon became a place where they become the most “unsocially social people”. These people focus more on the number of likes and followers instead of actually hanging out with family members. The hunger to get more views makes people engage into dangerous activities.",
      "Such addiction to social media platforms can actually rewire the neural connections in the brain and cause diseases like insomnia, ADHD and shorter attention spans. One must solely focus on a child’s holistic well-being rather than digital engagement."
    ],
    "images": [
      {
        "id": "2025CSBS_13_ARKA_DEB_DAS_DRIVE_ID",
        "caption": "The digital cradle: visualizing the evolution of social connectivity.",
        "position": 1
      }
    ]
  },
  {
    "id": "the-merrymaker-yashya-sharma",
    "title": "THE MERRYMAKER",
    "excerpt": "A horror short story about coulrophobia and a boy's terrifying encounter with Pennywise.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Yashya Sharma",
      "role": "1st Year, Department of ECE, Academy of Technology [Roll: 161]"
    },
    "paragraphs": [
      "‘Clown’ after hearing this word, we usually think of silly jokes that make people laugh but sometimes they can be the most terrifying thing a person can imagine.",
      "Ryan, a tenth standard boy, had one fear that always haunted him: coulrophobia, the fear of clowns. It started when a clown had tried to grab him away at a fair when he was a child. Later, it was found out that the man was actually a psycho killer.",
      "After moving to Kolkata, his cousins convinced him to watch the horror movie ‘IT’. The moment he saw Pennywise, his whole body froze. That night he couldn’t sleep. It felt like something was watching him from the dark corner of his room.",
      "One night, while returning from tuition, Ryan took a shortcut through an abandoned dirt path. He saw a shadow. Inside his room later, he noticed a dark shadow sitting near the window. It was Pennywise. The clown’s white face smiled at him, blood dripping from its mouth.",
      "From that day, he started seeing the clown everywhere—in mirrors, on terraces, under his bed. One night, Ryan woke up and saw the clown again. He asked, “Are you real?” A whisper came close to his ear: “Yes.”"
    ],
    "images": [
      {
        "id": "1stECE_161_YASHYA_SHARMA_DRIVE_ID",
        "caption": "The terrifying shadow of the clown in a dark corner.",
        "position": 1
      }
    ]
  },
  {
    "id": "world-without-money-omkar-mahato",
    "title": "A World Without Money: Humanity as Currency",
    "excerpt": "A philosophical exploration of a post-currency society where value is measured in kindness and purpose.",
    "department": "humanities",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Omkar Mahato",
      "role": "1st Year, Department of CSE, Academy of Technology [Roll: 101]"
    },
    "paragraphs": [
      "What if, one morning, we woke up to a world where money had silently vanished? People who once measured success in salaries might finally measure it in smiles. Every act of giving would carry more weight than gold ever could.",
      "In such a world, education wouldn’t be bought—it would be shared. The walls between \"mine\" and \"yours\" would crumble into dust. Humanity would see itself not as fragments competing for more, but as one living community.",
      "The disappearance of money would force a profound question: Why do I work? Motivation would shift from external reward to internal purpose. The teacher teaches because there is a profound satisfaction in illuminating a mind. Innovation would no longer be geared toward profit, but toward solving universal human problems.",
      "We stopped seeing people as souls and began labelling them by income. We forgot that compassion cannot be counted. Imagine leaders who serve without greed and doctors who heal for humanity. Wouldn’t that be the richest civilization ever known?",
      "The transformation begins not in the system, but in the soul. Perhaps the greatest wealth is not stored in banks, but in the quiet goodness we give away freely. When the last coin loses its shine, humanity will finally see its own reflection—pure, priceless, and free."
    ],
    "images": [
      {
        "id": "FirstYearCSE_101_OMKAR_MAHATO_DRIVE_ID",
        "caption": "A community thriving on shared resources and human connection.",
        "position": 1
      }
    ]
  },
  {
    "id": "quiet-strength-sneha-sarkar",
    "title": "The Quiet Strength Within",
    "excerpt": "Redefining strength not as loud achievements, but as the silent resilience and gentleness found in everyday life.",
    "department": "humanities",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Sneha Sarkar",
      "role": "2nd Year, Department of ECE, Academy of Technology [Roll: 16900324205]"
    },
    "paragraphs": [
      "The Quiet Strength Within:",
      "Amidst the whirlwind pace of life today, strength is typically defined as loud, visible, and heroic. But the reality is, not all strength shouts. It is the softest of voices that are the loudest of all. It is the quietest of rises after each fall, the greatest of battles fought silently.",
      "There are innumerable stories of quiet strength each day—it's in the eyes of a student who doesn't pass an exam but doesn't give up. It's in the mother who won't let tears fall so that her family can smile. Strength is not always breaking barriers; sometimes, it's about clinging on when everything whispers to release.",
      "Social media has perfected the art of showcasing achievements but not vulnerability. But perhaps that's where quiet strength resides—in the patience to grow slowly, in the courage to embrace imperfection. There is the strength to be gentle in a world that usually pays for nastiness.",
      "To gaze at oneself in the mirror and accept each flaw—that is strength. To begin anew after heartbreak—that is strength. So the next time you are doubting yourself, remember this: You are stronger than you realize. Sometimes, being here is the most courageous thing of all."
    ],
    "images": [
      {
        "id": "2ND_year_ECE_16900324205_SNEHA_SARKAR_DRIVE_ID",
        "caption": "A small plant growing through a crack in the pavement: quiet resilience.",
        "position": 1
      }
    ]
  },
  {
    "id": "insecurity-of-women-samridha-dutta",
    "title": "The Insecurity of a Woman in Our Society",
    "excerpt": "Addressing social issues regarding women's safety and the urgent need for systemic and societal changes.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Samridha Dutta",
      "role": "Session 2025-26, Department of CSBS, Academy of Technology [Roll: 35]"
    },
    "paragraphs": [
      "The insecurity of a woman in our society",
      "A woman is someone who cares, who stands by her family, who teaches the real values of life. Nevertheless, the insecurity of a woman in our society stands out to be one of the greatest social issues today. The most common cause is ill treatment or sexual harassment.",
      "In our country, women are unsafe everywhere, be it at workplace or at home. The recent R.G. Kar incident gives us evidence of how much a woman has been deprived of safety even in the workplace. This raises a big concern in our minds.",
      "A woman must adapt herself to necessary self-defensive steps. Measures include keeping safety tools and emergency phone numbers. Governmental and non-governmental institutions must take necessary steps, such as setting up CCTV cameras in institutions and public places.",
      "Families should support every girl child and empower them. Once everyone starts cooperating and respecting women, there will be no barriers in the society and we can together accomplish our future goals as a healthy nation."
    ],
    "images": [
      {
        "id": "d/1XDL_3Cxix5cEo8AtSZIDzNl0AdY0hxc-",
        "caption": "Safety awareness and the empowerment of the girl child.",
        "position": 1
      }
    ]
  },
  {
    "id": "moon-cries-alone-srija-bhaduri",
    "title": "The Moon Cries Alone In His Sky",
    "excerpt": "A short, evocative prose-poem about the eternal, lonely distance between the moon and the sun.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Srija Bhaduri",
      "role": "1st Year, Department of CSE-AIML, Academy of Technology [Roll: 54]"
    },
    "paragraphs": [
      "The moon cries alone in his sky, the sun shines less in her sky.",
      "“Oh moon you’ve not changed.” the sun called out. “It seems like the space and planets are angry on us” Rain is made of her tears, and shooting stars are made of his sorrows. “Do you think the earth will mourn us?”",
      "He gazes upon her from afar, his tears weaving silver through the clouds, his voice unheard. For he borrowed her glow, a thief of grace, and yet, without his stolen light, the earth would drown in endless dark.",
      "And when the world slumbers he lights the path of dreamers—not knowing that in her lonely heart, the sun dims too, for she shines less in her sky."
    ],
    "images": [
      {
        "id": "SRIJA_BHADURI_MOON_DRIVE_ID",
        "caption": "The silver moonlight illuminating the lonely night sky.",
        "position": 1
      }
    ]
  },
  {
    "id": "silence-unsaid-words-riddhima-mallick",
    "title": "Silence: The Beauty of Unsaid Words",
    "excerpt": "Exploring the powerful medium of silence in communication, self-reflection, and healing.",
    "department": "humanities",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Riddhima Mallick",
      "role": "1st Year, Department of CSE, Academy of Technology [Roll: 122]"
    },
    "paragraphs": [
      "Silence: The beauty of unsaid words",
      "\" Silence is the purest form of journey to our soul. \" Just like a lotus blossoms in the stillness of night, silence nurtures growth in the secret chambers of the heart. Practically, it transmits a lot of perceivable messages that cannot be heard but sensed.",
      "The heart decodes the nuanced language of each and every silence. Some feel like home, while some are awkward with unspoken truths. There are silences that shroud pain, but the same one sometimes heals us. It is the intimacy of tranquility where words would only create disturbance.",
      "Conversely, the stillness after each loss symbolizes pain. It is always so heavy that it is better to shed tears rather than getting petrified into a stony silence. We choose it when we prefer peace over chaos. Just as a pause gives meaning to our sentences, it provides meaning to life.",
      "As Shakespeare said, \" Silence is the perfectest herald of joy \" which shows that at times of extreme joy or sorrow, silence transcends the need for verbal expression. Silence is never emptiness but full of unexpressed emotions. Sometimes, it stands out to be the strongest weapon to protest.",
      "Silence is everywhere—just at the very beginning of a conversation and similarly after the goodbye. It can be the pause to the cacophony, a wait to the new beginning in the post-apocalyptic world."
    ],
    "images": [
      {
        "id": "Silence_1st_year_CSE_122_RIDDHIMA_MALLICK_DRIVE_ID",
        "caption": "The quiet beauty of a lotus blossoming in the stillness of night.",
        "position": 1
      }
    ]
  },
  {
    "id": "women-empowerment-patriarchy-sudipta-bakshi",
    "title": "Patriarchy: The Threat to Women Empowerment",
    "excerpt": "Analyzing the impact of patriarchy and defining true empowerment as financial independence and the right to education.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Sudipta Bakshi",
      "role": "1st Year, Department of CSE3, Academy of Technology"
    },
    "paragraphs": [
      "PATRIARCHY, THE ULTIMATE THREAT TO THE PATH OF WOMEN EMPOWERMENT.",
      "We are all familiar with the word ‘Patriarchy’—a system that defines men as superior, giving them the right to impose power over women. While empowerment schemes have led to a decrease in this practice, it is still predominantly present in remote areas.",
      "Women empowerment helps women understand their worth and the need for education and financial independence. Empowering women will help societies evolve and contribute to advancement. Empowerment begins when a woman speaks up against limitations.",
      "The first step begins at home. Parents should teach daughters to have big dreams and teach sons to be emotionally intelligent and respect the dreams of the opposite gender. Cracking misogynistic jokes does not make them look cool; it questions a girl's ability.",
      "The actual meaning of feminism means the establishment of equality. It stands by the thought that women are not only built for getting married but also for contributing to their own personality development. Empowering youth includes preaching equality to both men and women."
    ],
    "images": [
      {
        "id": "WOMEN_EMPOWERMENT_SUDIPTA_BAKSHI_DRIVE_ID",
        "caption": "Breaking the chains: a visual representation of empowerment.",
        "position": 1
      }
    ]
  },
  {
    "id": "phire-dekha-soumyadeep-kundu",
    "title": "ফিরে দেখা (Looking Back)",
    "excerpt": "A Bengali poem reflecting on the theater of memory, the loss of childhood curiosity, and the heavy debts of growing up.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Soumyadeep Kundu",
      "role": "2nd Year, Department of CSE [103]"
    },
    "paragraphs": [
      "স্মৃতির রঙ্গমঞ্চ,আর এক পেয়ালা ধুমাইত অতীত / দৃশ্যপটে আড়ালে হারানো আবছা চরিত্রের ক্লান্ত ভিড় / চতুর্ভূজ ছুঁয়ে ছুঁয়ে হাতড়ায় নীরবতা / মুহূর্তেরা তবু মুহূর্তকে বলতে চেয়েছে কথা",
      "শৈশবের সীমাহীন কৌতুহল পেরিয়ে প্লাবন এনেছি বুকে / ভাবতাম বড় হলেই বুঝি স্ব - অধীনে বেঁচে থাকব সুখে / সবুজ ঘাসে ফুটবল খেলা ,না মেনে বাধা করে অবহেলা / ছুটে যেতো মন নবীন সাগরে খুঁজে নিতে নতুন করে জীবন",
      "উপাখ্যানে মন ছুঁয়ে যাওয়ার আশিয়ানা । / বয়স বেড়েছে, বেড়েছে বোঝা ,স্কুল জীবন যেন ফিরে ফিরে আসে কল্পনায়-- / সেই টিফিন সেই ক্লাসরুম ,সেই বন্ধুদের কলতান -বেঞ্চে বসে ক্লাসের মাঝে ডুবে থাকা জানলায়",
      "ছিলনা দুঃখ ছিলনা বোঝা ;মনে হতো জীবন বড়ই সোজা / পুকুর হতে আজ এসেছি সাগরে -বুঝেছি কঠিন বাঁচা, ধুমায়িত শহরে / নরম রোদে বাজে শহর ,অনুভূতির ছদ্মবেশে স্মৃতির চাদর |",
      "ব্যস্ত জগত, ব্যস্ত জীবন ,ব্যস্ত হয়েছে দিন / প্রাপ্ত বয়সে ঘুরে ফিরে আজও বুঝতে পারিনি সেই শৈশব মনের ঋণ ||"
    ],
    "images": [
      {
        "id": "2CSE2_103_SOUMYADEEP_KUNDU",
        "caption": "The canvas of memories fading into the busy city life.",
        "position": 1
      }
    ]
  },
  {
    "id": "ochena-sei-meyeti-mouli-chattopadhyay",
    "title": "অচেনা সেই মেয়েটি (The Unknown Girl Within)",
    "excerpt": "A narrative poem about facing societal mockery and finding the inner strength to persevere through unemployment and personal struggle.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Mouli Chattopadhyay",
      "role": "2nd Year, Department of ECE [075]"
    },
    "paragraphs": [
      "মেয়েটি আজও এসেছিল, / রোজই আসে, / সমাজের উপহাসে পরিশ্রান্ত / আমি যখন আশ্রয় খুঁজি / বিনিদ্র রাত্রিযাপনে, / সেই মেয়েটি আমার কাছে আসে।",
      "স্কুলের গন্ডি ছাড়িয়ে যেদিন / দিলেম কলেজে পা, / সবাই বলল,\"মেয়ে বুঝি বিদ্যেধরী / হবে? ভালো ঘরে বিয়ে দাও / বর না হয় বিদেশ নিয়ে যাবে।\" / হায় রে, যুগের আধুনিকতা!",
      "যেদিন প্রথম মায়াময় পৃথিবীর / কুৎসিত রূপটা,পাশের সিটে বসা / লোকটার নোংরা চাহনিতে দেখলেম, / কিংবা সেদিন যেদিন প্রথম মন ভাঙল, / প্রতিবারই মেয়েটি এসেছিল, / বুঝিয়েছিল টিকতে হলে লড়তে হবে।",
      "আজ আবারো মেয়েটি এলো, / বেকারত্বের চিন্তার ভারে আমি / যখন নুইয়ে পড়েছি অতল খাদে, / তখনি অদম্য ইচ্ছাশক্তি ও দৃঢ়তার / বলয়ে আবৃত হয়ে মেয়েটি এলো।",
      "সে আমার অচেনা তবুও যেন জন্মের চেনা; / যেন একই শ্বাস প্রশ্বাস, যেন তাকে / প্রতিদিন আয়নার ওপারে দেখি, / অচেনা এই সত্তাটি প্রতিবারই বলে / যায় \"ওঠো, থেমো না, এগিয়ে চলো\"।"
    ],
    "images": [
      {
        "id": "2ECE2_075_MOULI_CHATTOPADHYAY",
        "caption": "The unknown entity beyond the mirror urging one to move forward.",
        "position": 1
      }
    ]
  },
  {
    "id": "atiter-dine-siuli-sarkar",
    "title": "অতীতের দিনে (In Bygone Days)",
    "excerpt": "A nostalgic journey through village memories, school days, and the simple joys of a childhood spent under a mother's protection.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Siuli Sarkar",
      "role": "2nd Year, Department of MCA [35]"
    },
    "paragraphs": [
      "আলোছায়ার মিছিলে হারিয়ে গেছে স্মৃতিরা / কালের স্রোতে ভেসে গেছে স্বপ্নের ধারা / অহনিশি সময় যেন জ্বলছবি আঁকে / মুহূর্তেরা আবার যদি একটু পিছু ডাকে",
      "শোনা যাবে আকাশবাণী নিশানে বাজবে সুর / আবারো পড়বো কাশফুলে ঢাকা নিশ্চিন্তপুর / সন্ধ্যা হলেই পল্লীগ্রামের সাতটি তারার গান / জ্বালিয়ে দেবো আলোর ছিটে থাকবে নাকো গ্লান",
      "বিকেল হলেই পাড়ি দেবো দূর দিগন্তে মিশে / রাতে আবার জলদস্যু সপ্তরাজার দেশে / দেখা হবে পাঠশালার প্রথম দিনের মন খারাপের সাথে / ফিরবো আবার রাঙা মাটির বৃষ্টি ভেজা পথে",
      "রইবো মোরা সারাজীবন মায়ের আঁচল তলে / গাইবো গান তুলবো ফুল আবার ভোরবেলায় / সময় যে থেমেছে এবার অবেলায়",
      "জীবন পাতায় অহরহ অনেক আছে ফাঁকি / হিসাব করে দেখা গেলো অষ্টআনাই বাকি / ব্যাস্ত সময় ক্লান্ত শরীর শক্ত হবে পথ / তবু মোদের টানতে হবে জীবন নামক রথ"
    ],
    "images": [
      {
        "id": "2MCA35_SIULI_SARKAR",
        "caption": "The chariot of life moving forward through the paths of memory.",
        "position": 1
      }
    ]
  },
  {
    "id": "open-book-guy-srija-adhya",
    "title": "The Open Book",
    "excerpt": "A poem about two broken souls meeting and learning that things fall apart to make way for better things, symbolized by the smell of petrichor.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Srija Adhya",
      "role": "3rd Year, Department of ECE [094]"
    },
    "paragraphs": [
      "I met a guy who was an open book, / Wanting to be read from the very start, / Someone who'd flick through his every page, / And tie again the strings of his very heart.",
      "So I peeked into his ribcage, / Holding my brittle pieces in hands, / To the guy I once gave my heart to, / My soul's revolt who could never understand.",
      "We were both left with empty spaces, / At first, within us our past self was no more. / And we let our souls to feel each other's touch, / Like waves embracing the sea shore.",
      "Together we learned a lesson, / Of how sometimes things fall apart, / To make way for better things lover / Which leaves a solid wound on your heart.",
      "So next time when the rain hits the ground, / Do not run reaching out for a cover, / Just stand and smell the petrichor, / You'll find an umbrella held by a broken lover."
    ],
    "images": [
      {
        "id": "3ECE2-094_SRIJA_ADHYA",
        "caption": "The petrichor and the umbrella of a broken lover.",
        "position": 1
      }
    ]
  },
  {
    "id": "bygone-days-abhishek-mahato",
    "title": "Those Bygone Days",
    "excerpt": "Retro-filtered memories of a grandmother's kitchen and swinging from the roots of an old banyan tree.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Abhishek Mahato",
      "role": "2nd Year, Department of EE [037]"
    },
    "paragraphs": [
      "In the retro filter of my memory's frame / Where me and my whisper still remain / From echoing laughter to the unpredictable rain / Me and my whisper still remain in my frame.",
      "The scent of a grandmother's kitchen / Always being sweet and tasty / From houses to the grounds / Easily, it spreads warmly.",
      "The old banyan tree covered with roots. / Holding us as we swing, trembling all over the shoots. / One by one, we swing, and one by one, we push. / Till one falls and oops, who pushed?",
      "The golden, nostalgic days / Hurriedly went to so far / With echoing laughter and fun / Instantly after the rise of the sun."
    ],
    "images": [
      {
        "id": "2EE_037_ABHISHEK_MAHATO",
        "caption": "Swinging from the ancient banyan tree in the rise of the sun.",
        "position": 1
      }
    ]
  },
  {
    "id": "shobdo-pipasha-sowhom-ghosh",
    "title": "শব্দ-পিপাসা (Thirst for Words)",
    "excerpt": "A poignant poem about a struggling writer facing poverty and the temptation of despair, finding refuge in the poetry of the suburbs.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Sowhom Ghosh",
      "role": "3rd Year, Department of ECE [096]"
    },
    "paragraphs": [
      "ছন্দাভাবে শব্দ-পিপাসা, / বেরঙ্গিন বহু নিরাশা। / কলম ফেলে পায়চারি, শব্দকোষে দিই পাড়ি, / বারান্দাতে শোকের ছায়ায় হয়ে ওঠে বুক ভারি।",
      "ফিরে আসি কেদারাতে, শুন্যতার কলম হাতে; / অতীত কোনো শোক আঁকড়ে লিখতে বসি সুপ্রভাতে। / সুপ্রভাতের হিসাব নাই, শুন্য পাতায় ছন্দ চাই, / পেটের জ্বালায় পুঁজি হাতড়ে হতাশায় ডুবে যাই।",
      "দারিদ্র্যের ধাক্কা খেয়ে মৃত্যুমায়া জাগে। / একদা তাই দাঁড়িয়ে পড়ি ইহলোকের প্রান্তরে, / পুরাতন এক শহর দেখি মৃত কবির অন্তরে।",
      "সুর-তাল-ছন্দ তখন কাব্যরসে বাড়তি বোঝা, / অনুভূতিই শ্রেষ্ঠ কবি, পাতায় পাতায় তাকে খোঁজা।",
      "তাই তো আমি চুপটি করে, পাঁচিল হতে ঘাপটি মেরে / শহরতলির কাব্য শুনি অনুভূতির হাতটি ধরে। / ফিরে আসি কেদারাতে, শুন্যতার কলম হাতে; / নতুন করে লিখতে বসি আবার কোন সুপ্রভাতে।"
    ],
    "images": [
      {
        "id": "3ECE2_096_SOWHOM_GHOSH",
        "caption": "The empty chair and the pen of a poet seeking feelings.",
        "position": 1
      }
    ]
  },
  {
    "id": "memories-in-exile-aditi-dutta",
    "title": "Memories in Exile",
    "excerpt": "A student's reflection on moving to a hostel, where familiar comforts like tea and family are replaced by cold beds and longing.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Aditi Dutta",
      "role": "3rd Year, Department of CSE [T-055]"
    },
    "paragraphs": [
      "Moving out of town was a dream, / But who knew, flash backs can be this extreme! / Days begin with tears concealed, and a longing sigh / As tasteless tea reminds me of horlicks’ sweet high.",
      "As I press my shirt and prepare for the day, / The mirror narrate tales of my careless way. / Tears used to adore my cheeks even at a silly thing, / Now they prefer drying up in the eyes within.",
      "In the vast and empty hostel room, / Happiness seems to be dear to gloom. / Familiar voices call, a distant and comforting sound, / Echoing Grandma's warmth, a solace that wraps around.",
      "Night brings exhaustion, and a yearning for rest, / The cold hostel bed whispers secrets of mother's loving nest. / Of course holidays are medicine to my fate, / But alas!! Every holiday comes with an ending date.",
      "I miss dad's pampered days ,but growth demands its toll, / A price I must pay as life is all about fall and roll. / Endless talks are all captured in memory's worn out frame, / We still converse but the word \"endless\" is somewhere lost in the time game."
    ],
    "images": [
      {
        "id": "3CSE1_T-055_ADITI_DUTTA",
        "caption": "The vast, empty hostel room and the mirror of past careless ways.",
        "position": 1
      }
    ]
  },
  {
    "id": "samudrasnan-abhishek-banerjee",
    "title": "সমুদ্রস্নান (Sea Bath)",
    "excerpt": "A Bengali poem depicting a boatman's unrequited love for a woman he imagines as Parvati during a sea bath.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Abhishek Banerjee",
      "role": "T-013"
    },
    "paragraphs": [
      "তুমি যদি থাকতে আমার সাথে / তোমায় আমি সাজাতাম বেশ করে / হতেম আমি গঙ্গানদীর মাঝি / পালটি আমার শক্ত সুতোয় বেঁধে",
      "এখন তুমি পার্বতী সেজে দাঁইড়ে / মোহনায় এখন জোয়ার চলছে বুঝি / তোমার ও রূপ নেহারিতে নাহি পারি / মুক্ত করো কি তাপ জ্বালা সাড়ি",
      "তোমায় নিয়ে সমুদ্রস্নানে এসে / প্রেমে পড়েছি স্নিগ্ধ কেশবাসে / দ্বীর্ঘ তোমার নয়নকাজল কালো / যাগের কালি ফিকে লাগে তার কাছে",
      "ভিজে কাপড়ে জল থেকে এলে উঠে / দেখতে কি পাওনা আমি পরাজিত এখানে ? / তোমাকেই দেখি দূর দেশান্তর ঘুরি / আর কারো কথা ভাবিতে নাহি পারি",
      "তবে আবার যেদিন সমুদ্রস্নানে যাবে / সেদিন আবার সঙ্গে নিয়ে যাব / নৌকা তুমি বাইতে শিখে যেও / কারণ আমি সমুদ্রে ঝাঁপ দেব।।"
    ],
    "images": [
      {
        "id": "ABHISHEK_BANERJEE_SAMUDRASNAN",
        "caption": "The boatman and the tide at the estuary.",
        "position": 1
      }
    ]
  },
  {
    "id": "tarun-kobike-arghya-kamalpatra",
    "title": "তরুণ কবিকে (To the Young Poet)",
    "excerpt": "A call to poetry as an asylum for youth who burn in the heat of their times, facing joblessness and heartbreak.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Arghya Kamalpatra",
      "role": "7th Semester, Department of ECE3 [144]"
    },
    "paragraphs": [
      "রোগাটে আঙুলে ক্ষয়ে ক্ষয়ে নামে মেঘ / ছিন্ন জীবনে ভিন্নরুচির ছেলে / চোখভরা ক্রোধে ঘুরে চলে যায় হাওয়া / কুয়াশায় হাঁটে উদ্ধত পা-ফেলে",
      "উন্নত গ্রীবা, মেরুদণ্ড-ও ভালো / সাধারণ লোক খবরও রাখে না তার / পাখিকে চেয়েও পেল কেবল পালক / জুতোর পেরেকে, লড়াকু সে অবতার",
      "বিষণ্ণ ছেলে, হুট করে জেগে ওঠে / কবিতারা নাকি বিক্রি হয় না তেমন / রাতে ভুখা পেট, জিভ- কে বুলিয়ে ঠোঁটে / নিজ মনে ভাবে—’ প্রতিরোধ লিখি যেন!’",
      "বাংলা যে তাকে চাকরি দেবে না জানি / দেবে না কোমল একখানা প্রেমটিও / যেসব যুবক সময়ের আঁচে পোড়ে / কবিতা, তাহাকে তুমি আশ্রয় দিও"
    ],
    "images": [
      {
        "id": "7ECE3_144_ARGHYA_KAMALPATRA",
        "caption": "The defiant spirit of a youth writing resistance against the times.",
        "position": 1
      }
    ]
  },
  {
    "id": "bahav-adarsh-singh",
    "title": "Bahav (Flow)",
    "excerpt": "A Hindi poem describing the struggle of a poet waiting for the ink to flow and the obstacles that periodically halt the creative stream.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Adarsh Singh",
      "role": "3rd Year, Department of ECE1 [54]"
    },
    "paragraphs": [
      "कागज़ मे न बहती स्याही / न शब्द से आज शब्द ब्याही  / कलम टिकी है एक जगह जो / लाख मनाया, हिलती नाही",
      "जब जब लागे कुछ जान पड़ा / तब तब सुझ वापस बिंदी मे अड़ा / बहाव रुकी है कोई एक जगह / जाने कौन बीच आ खड़ा",
      "पर बहाव इसकी थी कब निरंतर? / रुकाव आए जाने कितने भेस धरकर / और बाधा कोई, धारा को इसकी, / कितनी देर हो रोक सका?",
      "लिखनेवाला कलम हाथ में, / इसी लिए, पन्ने में ताक रहा"
    ],
    "images": [
      {
        "id": "3ECE1-054_ADARSH_SINGH",
        "caption": "The pen resting on paper, waiting for the stream of words.",
        "position": 1
      }
    ]
  },
  {
    "id": "aporichita-rakesh-bag",
    "title": "অপরিচিতা (The Unknown Woman)",
    "excerpt": "A mysterious nocturnal poem about a sad unknown woman who returns every night from the shadows of the past.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Rakesh Bag",
      "role": "4th Year, Department of EEE [005]"
    },
    "paragraphs": [
      "রহস্যময় নিশীথ রাত, অজানা নারীর অস্তিত্ব / মা বলে খোকা তুই , হস না এত ব্যাতিব্যাস্ত |",
      "চারিদিক হয়ে ওঠে, নির্জন থেকে নির্জনতর / অতীতের পার হতে, আসে সে অজানা আতঙ্ক |",
      "মৃত্যুর পায়ের ছাপ রেখে, আসে সে নিশব্দে / তবু তার ছোয়া লাগে,স্নিগ্ধতার প্রহরে | / বাতাসে হঠাৎ বেজে ওঠে সুর,জানান দেয় নিরব আতঙ্কের / অপরিচিতা আসে তখন,ধোয়াশার অন্ধকারে |",
      "চাদের আলোয় ভেসে ওঠে, তার বিষন্ন মুখখানি / এক সে সময় ছিল,ছিল তার রূপের কদর নাজানি কতখানি |",
      "প্রতিটি পদক্ষেপে তার, শোনা যায় মৃত্যুর সুর / অপরিচিতা ফিরে আসে , সময়ের মাঝে দুর্ভেদ্য দূর |",
      "অতীত ও ভবিষ্যতের, সন্ধিক্ষণের এই আশা যাওয়া / অপরিচিতা, সে এক চরিত্র রহস্য তে ভরা | / নীরবে আসে যায়, রেখে যায় তার ছাপ / জানান দেয়, সকাল হল নতুন দিনের প্রত্যাশায় |"
    ],
    "images": [
      {
        "id": "4EEE_005_RAKESH_BAG",
        "caption": "The mysterious face appearing in the moonlight and fog.",
        "position": 1
      }
    ]
  },
  {
    "id": "teleportation-to-childhood-sushmita-ghosh",
    "title": "Teleported to the Past",
    "excerpt": "An adult's 24-year-old brain finds itself in a 2nd-grade body, rediscovering school glee and the simple joy of buying candies for a mother.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Sushmita Ghosh",
      "role": "2nd Year, Department of CSBS [057]"
    },
    "paragraphs": [
      "I was late for my office, So / I ran and ran and suddenly I fell, / Knees hurting, I shook my head and astonished I see!",
      "I see kids walking with their school bags / I see them wearing uniforms, the same I used to wear / I see the city, the same I used to live in / And suddenly I hear a bell ring and all students running towards a gate",
      "Pihu ...I hear someone calling me, a known voice / My childhood friend Rishav arrived / And giving me a hand, he said, “let's go we're getting late for the class.”",
      "It's then, I realized I've been teleported to my 2nd grade body with the 24-year-old brain. / The stairs I see, the classroom I see, I see my desk and I sat there",
      "Being an introvert kid, never saw the glee / How much serenity I find here, knowing the adult tumultuous life. / Decided to not waste the present which has now become the bygone days",
      "On Sundays I no longer said \"No\" to picnics. / My mother loves Colorful candies, So everyday / On my way back home, I bought rainbows inside my bag for her bliss."
    ],
    "images": [
      {
        "id": "2CSBS_057_SUSHMITA_GHOSH",
        "caption": "The old school gate and the rainbow candies in a school bag.",
        "position": 1
      }
    ]
  },
  {
    "id": "blossoms-end-shubhrajyoti-gupta",
    "title": "Rejuvenating Blossom’s End",
    "excerpt": "A mournful poem about love found beneath cherry blossoms and the eventual acceptance of loss as petals fall.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Shubhrajyoti Gupta",
      "role": "3rd Year, Department of ECE2 [107]"
    },
    "paragraphs": [
      "Beneath the blossoms, bathed in pink, / A vision sparkled, my senses drink. / Her smile, a sunrise, gentle and warm / Eyes held the stars with twinkling charm.",
      "Love bloomed beneath the cherry's grace, / Hand in hand, a gentle pace. / Whispered secrets, hopes so bound / A love so true, forever found",
      "Now, petals fall, a mournful sigh, / Where laughter danced, a teardrop dry. / Beneath the boughs, where dreams took flight, / She sleeps in peace, a gentle light.",
      "Though sorrow lingers, a constant ache, / Acceptance’s hand, for her sake I take. / I move on, but a part remains, / Whispering her name through falling rains."
    ],
    "images": [
      {
        "id": "3ECE2_107_SHUBHRAJYOTI_GUPTA",
        "caption": "Cherry blossoms falling like tears in the rain.",
        "position": 1
      }
    ]
  },
  {
    "id": "struggling-poet-souvik-das",
    "title": "A Struggling Poet’s Anecdote",
    "excerpt": "The story of a poet wrestling with unwritten words, financial issues, and the choice to raise a voice against tactical manipulation.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Souvik Das",
      "role": "4th Year, Department of CSE2 [102]"
    },
    "paragraphs": [
      "In a room where shadows merge and part, A poet's heart wrestles with words that dart, Ink-stained fingers, trembling, pause, Caught in the labyrinth of unwritten cause.",
      "By candlelight, he scrawls and scribes, In search of words that won’t confide, The perfect phrase, just out of reach, Eludes his pen and mocks his speech.",
      "Lives solely for work, lack of recognitions, Fulfilling public demands just being quiet, Facing rejections, eliminations, financial issues Briefs an anecdote of a struggling poet.",
      "Real fight embarks on with raising voice against Power designed tactically to obscure, manipulate, He exposes grim truths, problems within systems, Not taking the injustices as their perpetual fate.",
      "But in the struggle, strength is found, In every silent, grieving, somber round, For even when the words won’t flow, The poet’s spirit learns how to grow."
    ],
    "images": [
      {
        "id": "4CSE2_102_SOUVIK_DAS",
        "caption": "Ink-stained fingers and a candle illuminating unwritten cause.",
        "position": 1
      }
    ]
  },
  {
    "id": "college-shash-samrat-mondal",
    "title": "শেষ হলো কলেজের পথ চলা (End of the College Journey)",
    "excerpt": "A sentimental farewell to college life, transitioning from unknown faces to precious memories of the canteen and classrooms.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Samrat Mondal",
      "role": "4th Year, Department of EE [053]"
    },
    "paragraphs": [
      "মনে পড়ে,সেই প্রথম দিন / একটা অজানা কলেজ / কিছু অচেনা মুখ,পরস্পরের পরিচয় জানতে চাওয়া। / অল্প দিনেই সবাই আপন / নতুন অধ্যায়,জীবনে এক নতুন গল্প খুঁজে পাওয়া।",
      "তারপর সেই শুরু / ক্লাস রুম, ব্ল্যাকবোর্ডে চোখ / শুরুটা বুঝলেও শেষটা কেবলই নোট করে গেছি। / মাষ্টারমশাই সবিই বোঝেন / তবুও বোকার মতো অজুহাত খুজেছি।",
      "মাত্র বছর চারেকের ব্যবধান / তারি মধ্যে কত আবেগ কত অভিমান। / ছিল রেজাল্টের চিন্তা,ছিল মৃদু অস্বস্তি / আর ছিল অনেক আনন্দ, সঙ্গে একটু বিরক্তি।",
      "কাল থেকে সবই অতীত / আজ তার ইতি, / একটা ছোট গল্পের, ছোট পরিণতি।",
      "অনেক কিছু রেখে গেলাম_ / ক্যান্টিনের আড্ডা,খেলার মাঠের হুল্লোড় / সংস্কৃতি অনুষ্ঠানের উল্লাস সবই নিতান্ত অল্প। / হয়তো বা,তবে নিয়ে গেলাম এই গুলোই / স্মৃতির মোড়কে মুড়ে,সঙ্গে অমূল্য কিছু অনুভূতি",
      "শেষ হলো কলেজের পথ চলা। / ফাঁকা বুকে,চাপা আবেগ / ছল ছল চোখের পাতা মৃদু কাঁপছে। / সময় হয়েছে এবার বিদায় দাও আমায় / চোখের জল ঝরে যাওয়ার অনুমতি চাইছে।"
    ],
    "images": [
      {
        "id": "4EE_053_SAMRAT_MONDAL",
        "caption": "The familiar wooden bench and the canteen where adda took place.",
        "position": 1
      }
    ]
  },
  {
    "id": "urban-utopias-madhuri-nandi",
    "title": "Urban Utopias",
    "excerpt": "A vision of a future city where nature and technology blend perfectly, and joy and success are balanced 50/50.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Madhuri Nandi",
      "role": "2nd Year, Department of CSE3 [178]"
    },
    "paragraphs": [
      "In our rainbow city of hope, / Joy and success happily cope. / Work and leisure are a 50/50 song, / In the city that we all belong.",
      "Our city runs on hope and love, / With verdant parks and shiny skies above. / Teenagers grow wiser day by day, / While children and old ones relish nature's way.",
      "Nature and tech, which blends on every block, / Where time seems to whisper, in our clock, / Design and progress developing hand in hand, / Creativity and sustainability enrich our land.",
      "We embrace unity and equality within our diversity, / Shaping our future and cultivating our destiny."
    ],
    "images": [
      {
        "id": "2CSE3_178_MADHURI_NANDI",
        "caption": "The rainbow city blending nature with sustainable design.",
        "position": 1
      }
    ]
  },
  {
    "id": "woman-i-did-not-know-azad-ansari",
    "title": "THE WOMAN I DID NOT KNOW (Hindi)",
    "excerpt": "A Hindi poem about winning the race of life but losing the chance to understand the silence in a loved one's eyes.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "MD Azad Ansari",
      "role": "3rd Year, Department of CSBS(X) [020]"
    },
    "paragraphs": [
      "জিহিন্দগী কী রেস মে জীত চুকা হুঁ / সব কুছ পাকর ভী লগত হ্যায় কি কুছ খো চুকা হুঁ…",
      "জিসে চাহত থা ম্যায় উসকো জান না পাযা / উসকী আঁখোঁ কী খামোশী কো পঢ় না পাযা / মেরী দিল কী বাত জুবান পর না আযা / উনকী বাতোঁ কে মতলব কো সমঝ না পাযা",
      "ম্যায় খুদ কো কোসতা হুঁ কি আখির ক্যো ম্যায় উনকী খামোশী কে বারে মে জান না পাযা। / বো अनजान সী থী জিসকো ম্যায় আজ তক জান না পাযা।"
    ],
    "images": [
      {
        "id": "3CSBS_020_MD_AZAD_ANSARI",
        "caption": "The silent mysteries in the eyes of an unknown woman.",
        "position": 1
      }
    ]
  },
  {
    "id": "tomare-chinina-priyo-aparup-banerjee",
    "title": "তোমারে চিনিনা প্ৰিয় (I Do Not Know Thee, My Love)",
    "excerpt": "A Bengali poem set in a misty mountain town where a glimpse of a woman near Kanchenjunga becomes an eternal memory.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Aparup Banerjee",
      "role": "139"
    },
    "paragraphs": [
      "আজ আমি ভিজে মাটির স্নিগ্ধতার চেয়ে / শতকোটি হাত ওপরে, / ফেলে এসেছি মোর প্রণয়ের বীজগুলিকে / অজানা কোনো পাহাড়ে।",
      "সে রোজ এসে বসতো ঈশান কোনের ঐ বেঞ্চটিতে / ঝলমলে এক সকালবেলায়, / আমার ঘর্মস্নাত, ক্লান্ত চোখদুটি থমকে যেত, / অচেনা সেই এলোকেশের খেলায়।",
      "কখনো মেঘের পর্দার আড়াল হতে / ঝলসে উঠত কাঞ্চনজঙ্ঘার ধবল মাথাটি, / প্রবল চিত্তে ছলছল করে উঠত তার নয়ন / ইচ্ছে করতো, বলে ফেলি মনের কথাটি।",
      "তবে অগ্রসর হতেই, কুহেলিকার এক অজানা প্রাচীর / ঢেকে দিত দৃষ্টি যেই, / শীতল বাতাস ভেঙে ফেলত ধবল প্রাচীর / ঐপারেতে চেয়ে দেখতাম, / সে আর নেই।",
      "কুয়াশার সেই পর্দাখানি যেইনা গেল সরে, / অশ্রুমাখা চোখের তারায় / দেখলাম চেয়ে মৃদু ইশারায় / অচেনা কারোর অচেনা ছোঁয়ায় / হাতটি ধরে উতলা হাওয়ায়, / আমার মনের শহর ছেড়ে পারি দিল বহুদূরে।।"
    ],
    "images": [
      {
        "id": "APARUP_BANERJEE_TOMARE_CHININA",
        "caption": "The white peak of Kanchenjunga appearing through the mist.",
        "position": 1
      }
    ]
  },
  {
    "id": "rai-dipanjana-mukherjee",
    "title": "রাই (Rai)",
    "excerpt": "A short Bengali poem about a woman named Rai breaking societal bounds to chase her dreams like a rising sun.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "1 min read",
    "author": {
      "name": "Dipanjana Mukherjee",
      "role": "4th Year, Department of ECE3 [167]"
    },
    "paragraphs": [
      "ইচ্ছে ডানা মেলছে তাই , / সমাজ শিখলে বন্দি রাই। / মিথ্যে নয় সত্যি এটা , / মেঘের আড়ালে রাইয়ের ছটা।",
      "ভাঙছে তবুও গড়ছে বাসা, / খুঁজছে রাই তার স্বপ্নের ভাষা। / হারবে না সে জিতবে লড়াই, / করবে সমাজ তার গুনের বড়াই।",
      "তাই আশা আর নিরাশার পাশে , / আজ রাইয়ের স্বপ্ন সূর্য হয়ে হাসে।।"
    ],
    "images": [
      {
        "id": "4ECE3_167_DIPANJANA_MUKHERJEE",
        "caption": "Rai's dreams rising like the sun behind the clouds.",
        "position": 1
      }
    ]
  },
  {
    "id": "freedom-rumna-das",
    "title": "I Want To Be Free",
    "excerpt": "A poem about the loss of emotion and flesh through sorrow, and the desperate wish to return to a dream of being a happy human.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "2 min read",
    "author": {
      "name": "Rumna Das",
      "role": "2nd Year, Department of ME [17]"
    },
    "paragraphs": [
      "The breeze I feel now, / The flower I see . / It all says, / I want to be free.",
      "Do I deserve happiness? / Do I deserve to be free? / I questioned myself – / When I was a young tree.",
      "I lost flesh of my body , / I lost emotion from my heart , / I wish to be a happy human , / Which I missed in my past .",
      "The experience I had in my past ! / Full of sorrow and grief / As evil as hell , / So, I wished to remain in my dream."
    ],
    "images": [
      {
        "id": "2ME_17_RUMNA_DAS",
        "caption": "The young tree questioning the breeze and its right to be free.",
        "position": 1
      }
    ]
  },
  {
    "id": "mortality-of-the-diary-priyanjali-mukherjee",
    "title": "Mortality of the Diary",
    "excerpt": "A desperate attempt to cage the remains of a self-sabotaged soul, choosing to burn a diary of fortunes rather than let it be auctioned.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Priyanjali Mukherjee",
      "role": "3rd Year, Department of ECE1 [006]"
    },
    "paragraphs": [
      "I’m writing this as a desperate attempt to hold me, / To cage and care whatever little bit of me left inside this body; / A lot of me has drowned and died, / The ocean is bloody saline, my eyes are tired.",
      "Self-sabotage is the new game I’m playing / And trying hard to gather up the courage of living, / Believing those buried souls will once come to rescue me away",
      "Constant is continuing to sell my dreams or earn money on lease / And tease the beggar and tease the rich; / Release me! Let the demon destroy the devil.",
      "Tragedy is that I’ve written my fortune in that diary, / The diary that will be auctioned here, debts will be repaid / Honey dripping of my body will be the next thing to be auctioned then",
      "So if death is the fate at this stage, my last wish is to burn my diary / And let those ashes be free if I can’t be."
    ],
    "images": [
      {
        "id": "3ECE1_006_PRIYANJALI_MUKHERJEE",
        "caption": "The diary of fortunes being sacrificed to the fire.",
        "position": 1
      }
    ]
  },
  {
    "id": "acid-attack-asmita-mukherjee",
    "title": "THE WOMAN I DID NOT KNOW (Acid Attack Advocacy)",
    "excerpt": "A hard-hitting social commentary on bystander apathy regarding gender violence, told through the perspective of a silent waitress.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "4 min read",
    "author": {
      "name": "Asmita Mukherjee",
      "role": "3rd Year, Department of EE [014]"
    },
    "paragraphs": [
      "\"Another girl down with acid on her visage,Suspects are yet to be identified\" screamed the news headline / \"Ah, what a pity\", sighed Mrs.X taking a sip to her wine",
      "The waitress at a distance stood in silence, still pondering on the reported violence / When she recalled the events she had witnessed the day before, / At the old grocery shop behind her door, two rogues had arrived and said, \"Give us two bottles of acid, we are willing to pay you more\"",
      "No questions were asked, no protests were made. Everyone knew the purpose behind those bottles and their wicked smiles and today an innocent smile did fade. / \"Why did l nt I say anything, why didnt I speak??\" asked the waitress' heart",
      "The shackled brain replied with a voice low / \"Maybe because she was the woman I did not know\".",
      "Mrs.X put down her glass of wine, and recalled A coupled had moved- in in their neighborhood, two days back...and she did hear screams and cries and sounds of whacks / \"Why didnt I check on her, why didnt I bother???\", screamed her heart",
      "As she reflected on her remarks in the past...and while pondering over what she had witnessed few months back, she fell aghast / A boy had taken away this waitress with him, Force on his part and unwillingness on hers, were pretty visible"
    ],
    "images": [
      {
        "id": "3EE_014_ASMITA_MUKHERJEE",
        "caption": "The news headline and the silent bottles of acid.",
        "position": 1
      }
    ]
  },
  {
    "id": "shanti-krishnendu-sen",
    "title": "তার নাম কি? (What is Her Name?)",
    "excerpt": "A Bengali poem about a girl who represents peace, walking through the carnage of war and blood-stained weapons with a white flag.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Krishnendu Sen",
      "role": "3rd Year, Department of ECE1 [019]"
    },
    "paragraphs": [
      "আমি বহু নগরী ,প্রাসাদ ধুলিস্যাৎ হতে দেখেছি, / দেখেছি যুদ্ধ ,মৃত্যু ,ঘৃণাবৃত রক্তের দাগ ! / আপন জনের মুখ সাদা কাপড়ে ঢাকা।",
      "মৃত্স্তূপের উপরে একটি সাদা ফুল, / একটি ফুটে থাকা প্রাণ, একটি মেয়ে । / তার নাম কি?",
      "উড়তে থাকা সাদা পতাকা। / একটি লাশের পাশে পড়ে আছে দেবমূর্তি , / তাহলে ঈশ্বরও আজ নিরুপায়।",
      "রক্তের কাদা মাখা আগ্নেয়াস্ত্র গুলি যেন, / মেয়েটির চরণে পদ্ম হয়ে ফুটেছে। / তার নাম কি? সে কি আদৌ এই জগতের ?",
      "যে পৃথিবীর মাতৃদুগ্ধে বারুদ, / যে পৃথিবীর পুঁজিবাদী মুখগুলিও অর্থের দাস , / সেই জগৎ স্রোতের বিপরীতে, সাঁতরে বেঁচেছে মেয়েটি ।",
      "যুদ্ধের নৃশংসতা আমার চোখ কেড়ে নিয়েছে , / আমি এক অন্ধ ব্যক্তি এবং মেয়েটির নাম শান্তি।"
    ],
    "images": [
      {
        "id": "3ECE1_019_KRISHNENDU_SEN",
        "caption": "The white lotus growing from blood-stained weapons.",
        "position": 1
      }
    ]
  },
  {
    "id": "future-land-sayan-manna",
    "title": "THE FUTURE LAND",
    "excerpt": "A dystopian vision where buildings pierce the sky, children are made in labs, and free will is cut off like a green warrior shrub fighting glass.",
    "department": "abohoman",
    "date": "January 20, 2026",
    "readTime": "3 min read",
    "author": {
      "name": "Sayan Manna",
      "role": "2nd Year, Department of CSE2 [083]"
    },
    "paragraphs": [
      "Welcome to the Future Land. / Where buildings reach beyond the sky. / Neon ninjas curve the premises with beauty. / You may find a cactus on a balcony vase filled with sand.",
      "Where seasons are regulated as per machine will. / Where nobody marries, children don’t cry. / The rulers make children in the lab as per the land requires.",
      "Where people don’t read poems or see football match. / Here people only work. / Nobody cares about the century-old banyan tree or little wildflower.",
      "And rebel? You may find a rebel, / Just like on a blue flower vase a green shrub fighting against the glass. / But alas! the green warrior will be cut off.",
      "Welcome to the Future Land. / Where Humans are slave and Machines are king."
    ],
    "images": [
      {
        "id": "2CSE2_083_SAYAN_MANNA",
        "caption": "The neon skyscraper and the lab-grown generation.",
        "position": 1
      }
    ]
  }
]
